Dynamic Host Configuration Working Group                       Ted Lemon
Internet Draft						   Nominum, Inc.

Obsoletes: draft-ietf-dhc-csr-03.txt			  February, 2001
                                                    Expires August, 2001


	      The Classless Static Route Option for DHCP
		     <draft-ietf-dhc-csr-04.txt>

Status of this Memo

   This document is an Internet-Draft and is in full conformance with
   all provisions of Section 10 of RFC2026.

   This document is an Internet-Draft.  Internet-Drafts are working
   documents of the Internet Engineering Task Force (IETF), its areas,
   and its working groups.  Note that other groups may also distribute
   working documents as Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress".

     The list of current Internet-Drafts can be accessed at
     http://www.ietf.org/ietf/1id-abstracts.txt

     The list of Internet-Draft Shadow Directories can be accessed at
     http://www.ietf.org/shadow.html.

Abstract

   This document defines a new DHCP option which is passed from the
   DHCP Server to the DHCP Client to configure a list of static routes
   in the client.   This option supersedes the Static Route option
   (option 33) defined in [2].

Introduction

   The IP protocol [4] uses routers to transmit packets from hosts
   connected to one IP subnet to hosts connected to a different IP
   subnet.  When an IP host (the source host) wishes to transmit a
   packet to another IP host (the destination), it consults its
   routing table to determine the IP address of the router that should
   be used to forward the packet to the destination host.

   The routing table on an IP host can be maintained in a variety of
   ways - using a routing information protocol such as RIP [5], ICMP
   router discovery [6,7] or using the DHCP Router option, defined in
   [2].

   In a network that already provides DHCP service, using DHCP to
   update the routing table on a DHCP client has several virtues.  It
   is efficient, since it makes use of messages that would have been
   sent anyway.    It is convenient - the DHCP server configuration
   is already being maintained, so maintaining routing information, at
   least on a relatively stable network, requires little extra work.





   If DHCP service is already in use, no additional infrastructure
   need be deployed.

   The DHCP protocol as defined in [1] and the options defined in [2]
   only provide a mechanism for installing a default route or
   installing a table of classed routes.   Classed routes are routes
   whose subnet mask is implicit in the subnet number - see section
   3.2 of [4] for details on classed routing.

   Classed routing is no longer in common use, so the DHCP Static
   Route option is no longer useful.  Currently, classless routing,
   described in [8] and [9], is the most commonly-deployed form of
   routing on the Internet.  In classless routing, IP addresses
   consist of a network number (the combination of the network number
   and subnet number described in [8]) and a host number.

   In classed IP, the network number and host number are derived from
   the IP address using a bitmask whose value is determined by the first
   few bits of the IP address.  In classless IP, the network number
   and host number are derived from the IP address using a seperate
   quantity, the subnet mask.   In order to determine the network to
   which a given route applies, an IP host must know both the network
   number AND the subnet mask for that network.

   The Static Routes option (option 33) does not provide a subnet mask
   for each route - it is assumed that the subnet mask is implicit in
   whatever network number is specified in each route entry.   The
   Classless Static Routes option does provide a subnet mask for each
   entry, so that the subnet mask can be other than what would be
   determined using the algorithm specified in [4] and [8].

Definitions

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY" and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [3].

   This document also uses the following terms:

      "DHCP client"

           DHCP client or "client" is an Internet host using DHCP to
           obtain configuration parameters such as a network address.

      "DHCP server"

           A DHCP server or "server" is an Internet host that returns
           configuration parameters to DHCP clients.






Classless Route Option Format

   The code for this option is TBD, and its minimum length is 5 bytes.
   This option can contain one or more static routes, each of which
   consists of a destination descriptor and the IP address of the
   router that should be used to reach that destination.

    Code Len Destination 1    Router 1
   +-----+---+----+-----+----+----+----+----+----+
   | TBD | n | d1 | ... | dN | r1 | r2 | r3 | r4 |
   +-----+---+----+-----+----+----+----+----+----+

    Destination 2	Router 2
   +----+-----+----+----+----+----+----+
   | d1 | ... | dN | r1 | r2 | r3 | r4 |
   +----+-----+----+----+----+----+----+

   In the above example, two static routes are specified.

   Destination descriptors describe the IP subnet number and subnet
   mask of a particular destination using a compact encoding.   This
   encoding consists of one octet describing the width of the subnet
   mask, followed by all the non-zero octets of the subnet number.

   The width of the subnet mask describes the number of one bits in
   the mask, so for example a subnet with a subnet number of
   10.0.127.0 and a netmask of 255.255.255.0 would have a subnet mask
   width of 24.

   The non-zero portion of the subnet number is simply all of the
   octets of the subnet number, with the least significant octets that
   are zero omitted.   For a subnet mask width of between 25 and 32,
   the subnet number will be four octets.   Mask widths of between 17
   and 24 indicate a three-octet subnet number; between 9 and 16
   indicate a two-octet subnet number, between 1 and 8 indicate a
   one-octet number.   As a special case, the default route may be
   represented by a zero width, with no following subnet number.
   Host routes are represented by a mask width of 32, followed by four
   octets containing the IP address of the host.

   The following table contains some examples:

   Subnet number   Subnet mask      Destination descriptor
   0		   0		    0
   10.0.0.0	   255.0.0.0	    8.10
   10.17.0.0	   255.255.0.0	    16.10.17
   10.27.129.0	   255.255.255.0    24.10.27.129
   10.229.0.128	   255.255.255.128  25.10.229.0.128
   10.198.122.47   255.255.255.255  32.10.198.122.47






Local Subnet Routes

   In the case where there is more than one IP subnet connected to the
   local network, the DHCP server MAY send routes for those subnets
   specifying an IP destination address of 0.0.0.0.   This statement
   applies strictly to the Classless Static Routes option.   The
   behaviour of the DHCP client in the case that a Routers option
   contains a destination of 0.0.0.0 is not specified here.

DHCP Client Behavior

   DHCP clients that do not support this option MUST ignore it if it
   is received from a DHCP server.   DHCP clients that support this
   option MUST install the routes specified in the option.   DHCP
   clients that support this option MUST NOT install the routes
   specified in the Static Routes option (option code 33) if both a
   Static Routes option and the Classless Static Routes option are
   provided.

   DHCP clients that support this option and that send a DHCP
   Parameter Request List option MUST request both this option and the
   Router option [2] in the DHCP Parameter Request List.  DHCP clients
   that support this option and send a parameter request list MUST NOT
   request the Static Routes option.   The Classless Static Routes
   option code SHOULD appear in the parameter request list prior to
   the Routers option code.

   If the DHCP server returns both a Router option and a Classless
   Static Routes option, the DHCP client MUST ignore the Routers
   option.

   Some TCP/IP stacks can be configured to send ARP request messages
   on an interface for IP addresses that are on subnets not configured
   for that interface.   Consequently, DHCP clients that implement the
   Classless Static Routes option MUST check each route to see if the
   IP destination is 0.0.0.0, and MUST EITHER configure their IP stack
   to ARP for IP addresses whose routing destination is 0.0.0.0, OR
   ignore routes found in the Classless Static Routes option that have
   a destination of 0.0.0.0.

   After deriving a subnet number and subnet mask from each
   destination descriptor, the DHCP client SHOULD check each route to
   determine if there are any bits in the destination network number
   whose value is one whose corresponding value in the subnet mask is
   zero, and SHOULD NOT install any routes for which this is the case.
   For example, the client should not install a route with a
   destination of 129.210.377.4 and a subnet mask of 255.255.255.128.

Requirements to avoid sizing constraints

   Because a full routing table can be quite large, the standard 576
   octet maximum size for a DHCP message may be too short to contain
   some legitimate Classless Static Route options.   Because of this,
   clients implementing the Classless Static Route option SHOULD send





   a Maximum DHCP Message Size [2] option if the DHCP client's TCP/IP
   stack is capable of reassembling fragmented IP datagrams.   In this
   case, the client SHOULD set the value of this option to the MTU of
   the interface that the client is configuring.

   DHCP servers sending this option MUST use the technique described
   in [10] for sending options larger than 255 bytes when storing this
   option in outgoing DHCP packets.   DHCP clients supporting this
   option MUST support the technique described in [10] when reading
   this option from incoming DHCP packets.

DHCP Server administrator responsibilities

   Many clients may not implement the Classless Static Routes option.
   DHCP server administrators should therefore configure their DHCP
   servers to send both a Routers option and a Classless Static Routes
   option, and should specify the default router(s) both in the
   Routers option and in the Classless Static Routes option.

DHCP Server Considerations

   When a DHCP client requests both the Routers option and the
   Classless Static Routes option, and the DHCP server is configured
   with both a Classless Static Routes option and a Routers option
   that applies to the client, the DHCP server MAY exclude the Routers
   option from its response.

Security Considerations

   DHCP currently provides no authentication or security mechanisms.
   Potential exposures to attack are discussed in section 7 of the DHCP
   protocol specification [1]. The Classless Static Routes option can
   be used to misdirect network traffic by providing incorrect IP
   addresses for routers.

References

   [1]  Droms, R., "Dynamic Host Configuration Protocol", RFC 2131,
        Bucknell University, March 1997.
   [2]  Alexander, S. and Droms, R., "DHCP Options and BOOTP Vendor
        Extensions", RFC 2132, Silicon Graphics, Inc., Bucknell
        University, March 1997.
   [3]  Bradner, S., "Key words for use in RFCs to indicate requirement
        levels", RFC 2119, Harvard University, March 1997.
   [4]  Postel, J., "Internet Protocol", RFC 791, USC/Information
        Sciences Institute, September 1981.
   [5]  Hedrick, C.L., "Routing Information Protocol", RFC 1058,
        Rutgers University, June 1, 1988.
   [6]  Deering, S., "ICMP Router Discovery Messages", RFC 1256,
        Xerox PARC, September 1991.
   [7]  Postel, J., "Internet Control Message Protocol", RFC 792,
        USC/Information Sciences Institute, September 1981.
   [8]  Mogul, J., Postel, J., "Internet Standard Subnetting
        Procedure", RFC950, Stanford University, USC/Information
        Sciences Institute, August 1985.




   [9]  Pummill, T., Manning, B., "Variable Length Subnet Table For
        IPv4", RFC1878, Alantec, USC/Information Sciences Institute,
        December, 1995.
   [10] Lemon, T., "Encoding Long DHCP Options",
        draft-ietf-dhc-concat-00.txt, Nominum, Inc., February, 2001.

Author Information

Ted Lemon
Nominum, Inc.
950 Charter Street
Redwood City, CA 94043
email: Ted.Lemon@nominum.com

Expiration

   This document will expire on August 31, 2001.

Full Copyright Statement

   Copyright (C) The Internet Society (2000-2001).  All Rights
   Reserved.

   This document and translations of it may be copied and furnished to
   others, and derivative works that comment on or otherwise explain it
   or assist in its implementation may be prepared, copied, published
   and distributed, in whole or in part, without restriction of any
   kind, provided that the above copyright notice and this paragraph are
   included on all such copies and derivative works.  However, this
   document itself may not be modified in any way, such as by removing
   the copyright notice or references to the Internet Society or other
   Internet organizations, except as needed for the purpose of
   developing Internet standards in which case the procedures for
   copyrights defined in the Internet Standards process must be
   followed, or as required to translate it into languages other than
   English.

   The limited permissions granted above are perpetual and will not be
   revoked by the Internet Society or its successors or assigns.

   This document and the information contained herein is provided on an
   "AS IS" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING
   TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING
   BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION
   HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF
   MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.
